{
    "homeScreen": {
        "title": "COLORING WITH NUMBERS",
        "subtitle": "Image Representation",
        "startButton": "START",
        "selectLanguage": "Select language:"
    },
    "userIdentification": {
        "title": "Enter your email or user code or just your name:",
        "submitButton": "Submit",
        "anonymousButton": "Log in without my data",
        "exception": "Please enter your email or code."
    },
    "phaseSelection": {
        "title": "PHASE SELECTION",
        "buttonPhase1": {
            "title": "PHASE 1",
            "subtitle": "Images and pixels"
        },
        "buttonPhase2": {
            "title": "PHASE 2",
            "subtitle": "Encode images with 1s and 0s"
        },
        "buttonPhase3": {
            "title": "PHASE 3",
            "subtitle": "Compressed images"
        },
        "buttonPhase4": {
            "title": "PHASE 4",
            "subtitle": "Using run-length coding"
        },
        "helpButton": "Help",
        "aboutButton": "About"
    },
    "help": {
        "title": "HELP",
        "paragraph1": "Pixel Web Plugged Computing is based on the activity \"Image Representation\" from the book by Bell T. Witten, I. and Follows, M. (2011), \"Computer Science Unplugged - Teaching Computer Science without the use of the computer\" Translation by Luciano Porto Barreto, 2011.",
        "paragraph2": "In each phase you will find screens with informative content and also some screens with exercises.",
        "paragraph3": "We suggest that you start with Phase 1 and then follow the increasing order of the phases: Phase 2, Phase 3 and Phase 4.",
        "paragraph4": "You can repeat the activities at any time to improve your performance in each phase.",
        "paragraph5": "For more information, contact us via email:",
        "paragraph6": "We are continuously working to improve the experience of our users. Your feedback is very important. Help us by filling out evaluation forms available on project website:"
    },
    "about": {
        "title": "ABOUT",
        "paragraph1": "Pixel Web Plugged Computing is based on the activity \"Image Representation\" from the book by Bell T. Witten, I. and Follows, M. (2011), \"Computer Science Unplugged - Teaching Computer Science without the use of computers\" Translation by Luciano Porto Barreto, 2011.",
        "paragraph2": "This book presents practical, playful and accessible activities on various computer science topics. It is easy to use not only in classrooms but also outside, and can be administered by teachers and understood by children.",
        "paragraph3": "Pixel Web Plugged Computing presented here seeks to further simplify the application of the proposals without the need to produce additional materials. It shows some topics sometimes considered complex in a simple way for different audiences.",
        "paragraph4": "Pixel Web Plugged Computing is part of a family with several other educational resources for teaching computing. Learn more about the others by visiting our website:"
    },
    "phase1": {
        "title": "PHASE 1",
        "informationTexts": {
            "text1": "Did you know that computers store drawings, photographs, and other images using only numbers? We'll learn more about this later.",
            "text2": "Computer screens are divided into a grid of small, squares, each of which can be a specific color. We call these squares picture elements or pixels.",
            "text3": "In a black and white image, each pixel can be either black or white, so all the computer needs to store is which dots are black and which are white.",
            "text4": "An image corresponding to the letter C, for example, could be represented with binary numbers (bits). If 1 indicates a white square and 0 indicates a black square, then we could have a 5 X 6 pixel grid like the one illustrated above.",
            "text5": "Have you ever seen a facsimile (fax) machine? This device was widely used in the past to sending documents in black and white.",
            "text6": "A fax machine is basically a simple computer that scans a sheet of paper and identifies whether or not it is white and stores this information in approximately 1000 x 2000 pixels, which are transmitted to another fax machine using the telephone network.",
            "text7": "When the other fax machine receives the message, it prints the pixels on a page.",
            "text8": "To save on data storage and transmission, it is more interesting to use a data representation that saves the amount of information transmitted or stored."
        },
        "exercises": {
            "exercice1": {
                "text": "Color the pixels above black or white by clicking on each one of them and see the corresponding bit code (sequences of 0s and 1s)."
            },
            "exercice2": {
                "text": "Which code can represent the sequence of pixels above?",
                "alternatives": [
                    "1,0,1,0,1",
                    "1,1,1,0,1",
                    "1,1,0,0,0",
                    "0,0,0,1,0"
                ]
            },
            "exercice3": {
                "text": "How do you think messages sent through a fax machine were encoded?",
                "alternatives": [
                    "With a representation that saves the amount of data sent",
                    "Using black dots as 0 and white dots as 1"
                ]
            },
            "exercice4": {
                "text": "Considering what was presented, answer: What do fax machines do?",
                "alternatives": [
                    "Transmit audio messages",
                    "Edit images",
                    "Print pixels",
                    "Perform mathematical operations"
                ]
            }
        }
    },
    "congratulationsScreen": {
        "title": "CONGRATULATIONS!",
        "motivationalMessages": {
            "excellent": "Awesome! You got everything right!",
            "veryGood": "Very good! Almost perfect!",
            "good": "Good job! Keep practicing!",
            "acceptable": "You're on the right track! Let's improve!",
            "tryAgain": "Everything is a learning experience! Try again!"
        },
        "remakeButton": "Remake",
        "homeButton": "Home",
        "nextButton": "Continue"
    }
}